# from copy import copy
#
# from openpyxl import load_workbook
# from openpyxl.styles import Border, Side
# from datetime import datetime
# import logging
#
# # Configure the logger
#
#
#
#
#
#
# if __name__ == '__main__':
#     file_name = "КПArthur2024-07-03"
#     name = "Arthur"
#     phone = "+7912"
#     email = "ar@popov"
#     co_number = "316"
#     data = [
#         [1, 'Угол внешний кабель-канала WDK 100x130 мм, ПВХ светло-серый RAL7035', '6182747', 0, 'шт', 1, 0.0, '64',
#          '0', 'когда-то'],
#         [2, 'Угол внешний кабель-канала WDK 100x230 мм, ПВХ белый', '6192428', 0, 'шт', 1, 0.0, '64', '0', 'когда-то'],
#         [3, 'Отвод T-образный кабель-канала WDK 80x210 мм, ПВХ белый', '6192722', 0, 'шт', 1, 0.0, '64', '0',
#          'когда-то'], [4, 'Ручка для блока питания VH4, желтый', '6109845', 0, 'шт', 1, 0.0, '64', '0', 'когда-то'],
#         [5, 'Ручка для блока питания VH4L, желтый', '6109844', 0, 'шт', 1, 0.0, '64', '0', 'когда-то'],
#         [6, 'Перегородка разделительная кабель-канала Rapid 45-2, 38x2000 мм, безгалогенновая белый RAL 9010',
#          '6114166', 0, 'шт', 1, 0.0, '64', '0', 'когда-то'],
#         [7, 'Подвес для блока питания VH, желтый', '6109847', 0, 'шт', 1, 0.0, '64', '0', 'когда-то'],
#         [8, 'Подвес блока питания VH-4L 40x64x38 мм, сталь, черный', '6109849', 0, 'шт', 1, 0.0, '64', '0', 'когда-то'],
#         [9, 'Заглушка кабель-канала LKM 30x30 мм, сталь, цвет белый RAL 9010', '6249410', 0, 'шт', 1, 0.0, '64', '0',
#          'когда-то']
#     ]
#     form_excel(file_name, name, phone, email, co_number, data)
